tests/resources/premise.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fu="http://www.fu.gov.si/"
xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
<soapenv:Body>
<fu:BusinessPremiseRequest Id="data">
<fu:Header>
<fu:MessageID>4e64a93a-40fa-4c02-afb1-488534b85e4c</fu:MessageID>
<fu:DateTime>2015-07-17T09:30:47Z</fu:DateTime>
</fu:Header>
<fu:BusinessPremise>
<fu:TaxNumber>10039953</fu:TaxNumber>
<fu:BusinessPremiseID>AABB</fu:BusinessPremiseID>
<fu:BPIdentifier>
<fu:RealEstateBP>
<fu:PropertyID>
<fu:CadastralNumber>365</fu:CadastralNumber>
<fu:BuildingNumber>12</fu:BuildingNumber>
<fu:BuildingSectionNumber>3</fu:BuildingSectionNumber>
</fu:PropertyID>
<fu:Address>
<fu:Street>Slakova ulica</fu:Street>
<fu:HouseNumber>36</fu:HouseNumber>
<fu:HouseNumberAdditional>A</fu:HouseNumberAdditional>
<fu:Community>Trebnje</fu:Community>
<fu:City>Trebnje</fu:City>
<fu:PostalCode>8210</fu:PostalCode>
</fu:Address>
</fu:RealEstateBP>
</fu:BPIdentifier>
<fu:ValidityDate>1990-08-25</fu:ValidityDate>
<fu:SoftwareSupplier>
<fu:TaxNumber>10039953</fu:TaxNumber>
</fu:SoftwareSupplier>
<fu:SpecialNotes>Primer prijave poslovnega prostora</fu:SpecialNotes>
</fu:BusinessPremise>
</fu:BusinessPremiseRequest>
</soapenv:Body>
</soapenv:Envelope>